nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
/***************************************************************************************/
/*
 * intelligent_traffic_light
 * Created by Manuel Montenegro, Apr 22, 2019.
 * Developed for MOTAM project.
 *
 *  This is a intelligent traffic light.
 *
 *  This code has been developed for Nordic Semiconductor nRF52840 PDK & nRF52840 dongle.
*/
/***************************************************************************************/

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stddef.h>
#include <stdio.h>

#include "nrf.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_drv_power.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_gpiote.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "ble_radio_notification.h"

#include "app_error.h"
#include "app_util.h"
#include "app_timer.h"


// ======== Global configuration and functions ========

#define RED_STATE                               0x01                                        // Identifier of Red traffic light state
#define YELLOW_STATE                            0x02                                        // Identifier of Yellow traffic light state
#define GREEN_STATE                             0x03                                        // Identifier of Green traffic light state
#define EMERGENCY_RED_STATE                     0x04                                        // Identifier of red state due to a emergency vehicle is near
#define EMERGENCY_GREEN_STATE                   0x05                                        // Identifier of green state due to a emergency vehicle is near
#define RED_STATE_DURATION                      30                                          // Duration of red traffic light state in seconds (MINIMUM VALUE: 5 SECONDS)
#define YELLOW_STATE_DURATION                   5                                           // Duration of yellow traffic light state in seconds
#define GREEN_STATE_DURATION                    30                                          // Duration of green traffic light state in seconds
#define BLINKY_STATE_DURATION                   5                                           // Duration of blinky state of pedestrian green light
static uint8_t                                  lastState;                                  // Last traffic light state
static uint8_t                                  currentState;                               // Current traffic light state
static uint32_t                                 lastStateTicks;                             // Timers ticks of the last state change

static uint32_t timer_ticks_to_ms (uint32_t ticks);
static uint8_t current_state_duration ();


// ======== BLE configuration ========

// MOTAM Beacon static parameters
#define STATIC_PARAMETERS_LENGTH                0x12                                        // Length of ADV_DATA_TYPE, MOTAM_ID, LATITUDE AND LONGITUDE
#define ADV_DATA_TYPE                           0xFF                                        // Advertising data type (0xFF -> Manufacturer specific data)
#define MOTAM_ID                                0xBE, 0xDE                                  // MOTAM identifier (DEphisit BEacon in little endian)
#define LATITUDE                                0xA9, 0xDA, 0xE3, 0x41                      // GPS latitude of the beacon (float in little endian)
#define LONGITUDE                               0xBC, 0x98, 0x82, 0xC1                      // GPS longitude of the beacon (float in little endian)
#define DIRECTION_FROM                          0x23, 0X00                                  // From direction that applies (35)
#define DIRECTION_TO                            0x18, 0x01                                  // To direction that applies (280)
#define BEACON_TYPE                             0x04                                        // Type of MOTAM beacon (0x04 -> Intelligent Traffic Light)
#define DEFAULT_STATE                           0xFF                                        // Current state (0x00 red, 0x01 yellow, 0x02 green, 0xFF undeterminated)
#define DEFAULT_TIMEOUT                         0x00                                        // Time left for next state (0x00 -> no timeout)

// BLE configuration parameters
#define APP_BLE_CONN_CFG_TAG                    1                                           // Tag that identifies the BLE configuration of the SoftDevice
#define APP_BLE_OBSERVER_PRIO                   3                                           // BLE observer priority of the application. There is no need to modify this value
#define ADV_INTERVAL                            MSEC_TO_UNITS(100, UNIT_0_625_MS)           // The advertising interval for non-connectable advertisement

static ble_gap_adv_params_t                     m_adv_params;                               // Parameters to be passed to the stack when starting advertising
static ble_gap_adv_data_t                       m_adv_data;                                 // Struct that contains pointers to the BLE encoded advertising data
static uint8_t                                  m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;  // Advertising handle used to identify an advertising set
static uint8_t                                  m_enc_advdata_1 [BLE_GAP_ADV_SET_DATA_SIZE_EXTENDED_MAX_SUPPORTED]; // Buffer for storing encoded advertising data
static uint8_t                                  m_enc_advdata_2 [BLE_GAP_ADV_SET_DATA_SIZE_EXTENDED_MAX_SUPPORTED]; // Buffer for storing encoded advertising data

static uint8_t frame [] =                                                                   // Intelligent traffic light default frame
	{
		STATIC_PARAMETERS_LENGTH,
		ADV_DATA_TYPE,
		MOTAM_ID,
		LATITUDE,
		LONGITUDE,
		DIRECTION_FROM,
		DIRECTION_TO,
		BEACON_TYPE,
		DEFAULT_STATE,
		DEFAULT_TIMEOUT
	};

// BLE events handler declaration
static void ble_evt_handler (ble_evt_t const * p_ble_evt, void * p_context);
static void frame_init (void);

// Function for initializing the BLE stack
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

