nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
// Function for initializing the Advertising functionality
static void advertising_init(void)
{
	ret_code_t err_code;

    // Set the advertising parameters
//    m_adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;  // Extended advertising
    m_adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED; // BLE 4
    m_adv_params.p_peer_addr     = NULL;                                                    // Undirected advertisement
    m_adv_params.interval        = ADV_INTERVAL;                                            // Time between advertisements
    m_adv_params.duration        = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;                   // Never time out
    m_adv_params.max_adv_evts	 = 0;                                                       // No limit of advertising events
    m_adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;                                      // Allow scan request from any device
    m_adv_params.primary_phy 	 = BLE_GAP_PHY_CODED;                                       // Long range codification
    m_adv_params.secondary_phy   = BLE_GAP_PHY_CODED;                                       // Long range codification
//    m_adv_params.primary_phy 	 = BLE_GAP_PHY_1MBPS;                                       // BLE 4 codification
//    m_adv_params.secondary_phy = BLE_GAP_PHY_1MBPS;                                       // BLE 4 codification

    // Set the advertising data
    m_adv_data.adv_data.len = 0;                                                            // Still no data on frame
    m_adv_data.adv_data.p_data = m_enc_advdata_1;
    frame_init();

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
    APP_ERROR_CHECK(err_code);
}

// Build beacon frame with MOTAM beacon structure
static void frame_init (void)
{
    memset(m_adv_data.adv_data.p_data, 0, BLE_GAP_ADV_SET_DATA_SIZE_EXTENDED_MAX_SUPPORTED);
    m_adv_data.adv_data.len = sizeof(frame);
    memcpy (m_adv_data.adv_data.p_data, frame, sizeof(frame));
}

// Function for starting advertising
static void advertising_start(void)
{
    ret_code_t err_code;
    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}

// Function for updating advertising data
static void advertising_update (uint8_t * new_frame, uint8_t new_frame_size)
{
    ret_code_t err_code;

    static uint8_t advdata_flag = 1;                                                        // Last enc_advdata used. 
                                                                                            // Necessary in order to dinamically update adv data
    if (advdata_flag == 1)
    {
        memcpy (m_enc_advdata_2, new_frame, new_frame_size);
        m_adv_data.adv_data.p_data = m_enc_advdata_2;
        advdata_flag = 2;
    }
    else
    {
        memcpy (m_enc_advdata_1, new_frame, new_frame_size);
        m_adv_data.adv_data.p_data = m_enc_advdata_1;
        advdata_flag = 1;
    }

    m_adv_data.adv_data.len = new_frame_size;

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, NULL);
    APP_ERROR_CHECK(err_code);
}

// BLE events handler
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
            break;

        default:
            break;
    }
}

static void radio_active_handler ( bool radio_active );

// Radio notification will notify when an advertisement is sent
static void radio_notification_init (void)
{
    uint32_t err_code;

    err_code = ble_radio_notification_init
        (
        APP_IRQ_PRIORITY_LOW,
        NRF_RADIO_NOTIFICATION_DISTANCE_800US,
        radio_active_handler
        );
    APP_ERROR_CHECK(err_code);
}

// Handler for radio notification interruption (radio active and nonactive)
static void radio_active_handler ( bool radio_active )
{
    if (radio_active == false)
    {
        uint8_t timeout = current_state_duration() - (timer_ticks_to_ms (app_timer_cnt_diff_compute (app_timer_cnt_get(),lastStateTicks))/1000);
        frame[17] = currentState;
        frame[18] = timeout;
        advertising_update (frame, sizeof(frame));
    }
}


// ======== GPIO and timers initialization ========

// GPIO LED parameters
#define LED_RED                                 NRF_GPIO_PIN_MAP(1,10)
#define LED_YELLOW                              NRF_GPIO_PIN_MAP(1,13)
#define LED_GREEN                               NRF_GPIO_PIN_MAP(1,15)
#define LED_RED_PEDESTRIAN 			NRF_GPIO_PIN_MAP(0,29)
#define LED_GREEN_PEDESTRIAN			NRF_GPIO_PIN_MAP(0,31)
#define PIN_CHANGE_STATE                        NRF_GPIO_PIN_MAP(0,02)                      // GPIO that will capture change state pulses
#if defined (BOARD_PCA10056)
    #define BTN_CHANGE_STATE                    NRF_GPIO_PIN_MAP(0,11)                      // Button 1 on nRF52840 DK
#elif defined (BOARD_PCA10059)
    #define BTN_CHANGE_STATE                    NRF_GPIO_PIN_MAP(1,06)                      // Button 1 on nRF52840 Dongle
#endif

#define DURATION_RED 				APP_TIMER_TICKS(RED_STATE_DURATION*1000)    // Duration of red state in milliseconds
#define DURATION_YELLOW 			APP_TIMER_TICKS(YELLOW_STATE_DURATION*1000) // Duration of yellow state in milliseconds
#define DURATION_GREEN 				APP_TIMER_TICKS(GREEN_STATE_DURATION*1000)  // Duration of green state in milliseconds
#define DURATION_BLINKY				APP_TIMER_TICKS(BLINKY_STATE_DURATION*1000) // Duration of blinky in pedestrian green state in milliseconds

APP_TIMER_DEF (timer);                                                                      // Timer instance for traffic
APP_TIMER_DEF (timer_pedestrian);                                                           // Timer instance for pedestrian blinky green light
APP_TIMER_DEF (timer_change_state);                                                         // Timer instance for change state button
APP_TIMER_DEF (timer_btn_debounce);

// Put all LEDs to low
static void pins_clear ()
{
    nrf_gpio_pin_clear(LED_RED);
    nrf_gpio_pin_clear(LED_YELLOW);
    nrf_gpio_pin_clear(LED_GREEN);
    nrf_gpio_pin_clear(LED_RED_PEDESTRIAN);
    nrf_gpio_pin_clear(LED_GREEN_PEDESTRIAN);
}

// Handler triggered with button pulsation for manual configuration of traffic light
void btn_change_state_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    ret_code_t err_code;

    static uint8_t buttonPressedCont = 0;                                                   // Number of times button has been pressed without timeout reached

    // Implementation of button debounce filter
    static uint8_t debounceTimeOutReached = true;                                           
    err_code = app_timer_start ( timer_btn_debounce, APP_TIMER_TICKS(200), &debounceTimeOutReached);
    APP_ERROR_CHECK(err_code);
    if (!debounceTimeOutReached)
    {
        return;                                                                             // If the function is called before 200ms, its a button rebounce
    }
    debounceTimeOutReached = false;


    // If timeout was reached previously...
    if (buttonPressedCont != 0)
    {
        err_code = app_timer_stop (timer_change_state);
        APP_ERROR_CHECK(err_code);
    }

