nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
    buttonPressedCont++;

    err_code = app_timer_start ( timer_change_state, APP_TIMER_TICKS(750), &buttonPressedCont);
    APP_ERROR_CHECK(err_code);

        
}

// GPIO ports initialization
static void gpio_init()
{
    nrf_gpio_cfg                                                                            // Set up of Red Light
    (
        LED_RED,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );
    nrf_gpio_cfg                                                                            // Set up of Yellow Light
    (
        LED_YELLOW,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );
    nrf_gpio_cfg                                                                            // Set up of Green Light
    (
        LED_GREEN,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );
    nrf_gpio_cfg                                                                            // Set up of Green Light
    (
        LED_RED_PEDESTRIAN,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );
    nrf_gpio_cfg                                                                            // Set up of Green Light
    (
        LED_GREEN_PEDESTRIAN,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );

    pins_clear();                                                                           // Set all leds to low

    ret_code_t err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_config_t conf = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
    conf.pull = NRF_GPIO_PIN_PULLUP;

    err_code = nrf_drv_gpiote_in_init(BTN_CHANGE_STATE, &conf, btn_change_state_handler);   // Set up Button for manually change state
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_gpiote_in_init(PIN_CHANGE_STATE, &conf, btn_change_state_handler);   // Set up Button for manually change state
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(BTN_CHANGE_STATE, true);
    nrf_drv_gpiote_in_event_enable(PIN_CHANGE_STATE, true);
}

// Handle the timers: this will change the state of the traffic light
static void timer_handler (void *p_context)
{
    ret_code_t err_code;

    pins_clear();                                                                           // Set all leds to low

    if (lastState == RED_STATE)
    {
        currentState = GREEN_STATE;                                                         // New state: green
        nrf_gpio_pin_set(LED_GREEN);                                                        // Turn on green light
        nrf_gpio_pin_set(LED_RED_PEDESTRIAN);
        err_code = app_timer_start ( timer, DURATION_GREEN, NULL);
        APP_ERROR_CHECK(err_code);
    }
    else if (lastState == GREEN_STATE)
    {
        currentState = YELLOW_STATE;                                                        // New state: yellow
        nrf_gpio_pin_set(LED_YELLOW);                                                       // Turn on green light
        nrf_gpio_pin_set(LED_RED_PEDESTRIAN);                                               // Turn on pedestrian red light
        err_code = app_timer_start ( timer, DURATION_YELLOW, NULL);
        APP_ERROR_CHECK(err_code);
    }
    else if (lastState == YELLOW_STATE)
    {
        currentState = RED_STATE;                                                           // New state: red
        nrf_gpio_pin_set(LED_RED);                                                          // Turn on red lightb
        nrf_gpio_pin_set(LED_GREEN_PEDESTRIAN);                                             // Turn on pedestrian green light
        err_code = app_timer_start ( timer, DURATION_RED, NULL);
        APP_ERROR_CHECK(err_code);
        err_code = app_timer_start ( timer_pedestrian, (DURATION_RED-DURATION_BLINKY), NULL);   // Start timer in order to start pedestrian blinky state
        APP_ERROR_CHECK(err_code);
    }

    lastState = currentState;
    lastStateTicks = app_timer_cnt_get();
}

// Handle the pedestrian timer: start blinky pedestrian green light
static void timer_handler_pedestrian (void *p_context)
{
    ret_code_t err_code;

    static int blink_cont = (int) BLINKY_STATE_DURATION / 0.25;                             // Number of cycles of turning on-turning off

    if (blink_cont > 0)
    {
        if (!(blink_cont%2))
        {
            nrf_gpio_pin_clear(LED_GREEN_PEDESTRIAN);
            blink_cont--;
            err_code = app_timer_start ( timer_pedestrian, APP_TIMER_TICKS(250), NULL);
            APP_ERROR_CHECK(err_code);
        }
        else if (blink_cont%2)
        {
            nrf_gpio_pin_set(LED_GREEN_PEDESTRIAN);
            blink_cont--;
            err_code = app_timer_start ( timer_pedestrian, APP_TIMER_TICKS(250), NULL);
            APP_ERROR_CHECK(err_code);
        }
    }
    else
    {
        blink_cont = (int) BLINKY_STATE_DURATION / 0.25;
    }
}

// Handle the change state button timer: one pulsation normal state, two pulsations green emergency state, three pulsations red emergency state
static void timer_handler_change_state (void * p_context)
{
    ret_code_t err_code;

    uint8_t * buttonPressedContPointer = p_context;

    // Normal state
    if (*buttonPressedContPointer == 1)
    {
        lastState = YELLOW_STATE;                                                           // Initial traffic light state
        timer_handler(NULL);
    }
    // Green emergency state
    else if (*buttonPressedContPointer == 2)
    {
        currentState = EMERGENCY_GREEN_STATE;
        app_timer_stop(timer);
        app_timer_stop(timer_pedestrian);
        pins_clear();                                                                       // Set all leds to low
        nrf_gpio_pin_set(LED_GREEN);                                                        // Turn on green light
        nrf_gpio_pin_set(LED_RED_PEDESTRIAN);
    }
    // Red emergency state
    else if (*buttonPressedContPointer == 3)
    {
        currentState = EMERGENCY_RED_STATE;
        app_timer_stop(timer);
        app_timer_stop(timer_pedestrian);
        pins_clear();                                                                       // Set all leds to low
        nrf_gpio_pin_set(LED_RED);                                                          // Turn on green light
        nrf_gpio_pin_set(LED_RED_PEDESTRIAN);
    }

    *buttonPressedContPointer = 0;                                                          
}

// Implementation of button rebounce filter
static void timer_handler_btn_debounce (void *p_context)
{
    uint8_t * timeout = p_context;
    *timeout = true;
}

