nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
// Timer initialization
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create	( &timer, APP_TIMER_MODE_SINGLE_SHOT, timer_handler );
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create ( &timer_pedestrian, APP_TIMER_MODE_SINGLE_SHOT, timer_handler_pedestrian );
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create ( &timer_change_state, APP_TIMER_MODE_SINGLE_SHOT, timer_handler_change_state );
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create  ( &timer_btn_debounce, APP_TIMER_MODE_SINGLE_SHOT, timer_handler_btn_debounce );
    APP_ERROR_CHECK(err_code);
}

// Start the execution of concatenated timers
static void timers_start (void)
{
    timer_handler (NULL);
}

// Convert timer ticks to miliseconds
static uint32_t timer_ticks_to_ms (uint32_t ticks)
{
    return (ticks * 1000 * ((APP_TIMER_CONFIG_RTC_FREQUENCY) +1)) / APP_TIMER_CLOCK_FREQ;
}


// ======== Auxiliary functions ========

// Print beacon info by serial port
static void print_beacon_info (void)
{
    NRF_LOG_RAW_INFO("-------- INTELLIGENT TRAFFIC LIGHT BEACON --------\r\n");
    NRF_LOG_RAW_INFO("Latitude (little-end): 0x%02x 0x%02x 0x%02x 0x%02x\r\n", LATITUDE);
    NRF_LOG_RAW_INFO("Longitude (little-end): 0x%02x 0x%02x 0x%02x 0x%02x\r\n", LONGITUDE);
    NRF_LOG_RAW_INFO("Direction from (little-end): 0x%02x 0x%02x\r\n", DIRECTION_FROM);
    NRF_LOG_RAW_INFO("Direction to (little-end): 0x%02x 0x%02x\r\n", DIRECTION_TO);
    NRF_LOG_RAW_INFO("Beacon type: 0x%02x\r\n", BEACON_TYPE);
    NRF_LOG_RAW_INFO("--------------------------------------------------\r\n");
}

// Returns the duration of current traffic light state in seconds
static uint8_t current_state_duration ( )
{
    if (currentState == RED_STATE)
        return RED_STATE_DURATION;
    else if (currentState == YELLOW_STATE)
        return YELLOW_STATE_DURATION;
    else if (currentState == GREEN_STATE)
        return GREEN_STATE_DURATION;
    else
        return 0;
}


// ======== Board initialization ========

// Logging initialization
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

// Clock initialization
static void clock_init (void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_clock_lfclk_request(NULL);

    while(!nrf_drv_clock_lfclk_is_running())
    {
        /* Just waiting */
    }
}

// Power managemente initialization
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

// Function for handling the idle state (main loop)
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


int main(void)
{
    // Initialize
    log_init();
    clock_init();
    timers_init();
    power_management_init();
    gpio_init();
    ble_stack_init();
    advertising_init();
    radio_notification_init();

    // Start execution.
    lastState = YELLOW_STATE;                                                               // Initial traffic light state
    timers_start();
    advertising_start();
    print_beacon_info();

    // Enter main loop.
    for (;;)
    {
    	idle_state_handle();
    }
}
